y_connector/y-piece_r0.75mm_bg5mlpmin_in10mlpmin_o5cm_bg5cm_p9cm/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// TODO: what do these values mean?
dimensions [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
    outletPatch
    {
        type zeroGradient;
    }

    backgroundInletPatch
    {
        type flowRateInletVelocity;
        volumetricFlowRate 0.0000000833 // Volumetric/mass flow rate [m3/s or kg/s]
        value uniform (0 0 0); // placeholder
        extrapolateProfile false;
    }

    particleInletPatch
    {
        type flowRateInletVelocity;
        volumetricFlowRate 0.0000001666
        value uniform (0 0 0);
        extrapolateProfile false;
    }

    yConnectorPatch
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    propagationTubePatch
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
